/********************************************************************************/
/* Регистратор модулей                                                          */
/* Задачей регистратора является вызов точки входа в модуль из файла-списка     */
/* Модуль, получив управление, подпишется на события в менеджере событий        */
/*                                                                              */
/*                                                                              */
/*                                                                              */
/*                                                                              */
/*                                                                              */
/*                                                                              */
/*                                                                              */
/*                                                                              */
/*                                                                              */
/* Проект:      Neocore                                                         */
/* Автор:       Макшанов Олег Васильевич                                        */
/* Дата:        14 марта 2019г                                                  */
/* Версия:      0.1                                                             */
/* Компания:    ООО "ДиСиСи"                                                    */
/* mail:        pvp@dcconsult.ru                                                */
/********************************************************************************/

#include "kernel/kernel.h"


//********************************************************************************
kcodes core_modules_registration(void);




kcodes core_modules_registration(void)
{
    return 0;
}