/*******************************************************************************
 Ядро для выводв отладочной информации использует совю версию fprintf
 что бы не зависить от библиотеки newlib
 
 Проект:      Neocore                                                         
 Автор:       Макшанов Олег Васильевич                                     
 Дата:        7 мая 2019г                                               
 Версия:      0.1                                                          
 Компания:    ООО "ДиСиСи"                                                 
 mail:        pvp@dcconsult.ru 
 ******************************************************************************/