/********************************************************************************
 Менеджер обработчиков событий



 Проект:      Neocore                                                         
 Автор:       Макшанов Олег Васильевич                                     
 Дата:        14 марта 2019г                                               
 Версия:      0.1                                                          
 Компания:    ООО "ДиСиСи"                                                 
 mail:        pvp@dcconsult.ru 
 ********************************************************************************/

#include "kernel/kernel.h"

kcodes core_event_handlers(
    k_event event, core_task *tasks, uint16_t *task_num);