/*******************************************************************************
 Слой аппаратных абстракций.



 Проект:      Neocore                                                         
 Автор:       Макшанов Олег Васильевич                                     
 Дата:        14 марта 2019г                                               
 Версия:      0.1                                                          
 Компания:    ООО "ДиСиСи"                                                 
 mail:        pvp@dcconsult.ru 
 ******************************************************************************/

#include "hal/hal.h"
#include "hal/hal_stdio.h"

//Базовая инициализация аппаратных модулей
hal_retcode hal_init(void)
{
	hal_stdio_init();
    return 0;
}



