/********************************************************************************
  Модуль управления часовым генератором.



 Проект:      Neocore                                                         
 Автор:       Макшанов Олег Васильевич                                     
 Дата:        14 марта 2019г                                               
 Версия:      0.1                                                          
 Компания:    ООО "ДиСиСи"                                                 
 mail:        pvp@dcconsult.ru 
 ********************************************************************************/

#include "hal/hal.h"
#include <stm32l1xx_rcc.h>

// Установка внешнего кварца 32.768 кГц.
// Установку достаточно провести один раз при инициализации системы.
hal_retcode hal_start_lse(void)
{

    return hal_ok;
}