/*******************************************************************************
 
 
 Проект:      Neocore                                                         
 Автор:       Макшанов Олег Васильевич                                     
 Дата:        7 мая 2019г                                               
 Версия:      0.1                                                          
 Компания:    ООО "ДиСиСи"                                                 
 mail:        pvp@dcconsult.ru 
 ******************************************************************************/


// Уровни отладки ядра. Для отключения отладки закоментируйте необходимую строку
#define DBGLVL1
#define DBGLVL2
#define DBGLVL3
