/*******************************************************************************
 В этой версии я не буду пытаться создать универсальную библиотеку
 Кстати прерывания по выводам настраиваться должны тутже.
 
 Проект:      Neocore                                                         
 Автор:       Макшанов Олег Васильевич                                     
 Дата:        26 июня 2019г                                               
 Версия:      0.1                                                          
 Компания:    ООО "ДиСиСи"                                                 
 mail:        pvp@dcconsult.ru 
 ******************************************************************************/
#pragma once

#include "lld_gpio.h"

/*******************************************************************************
Определение состояний выводов
*******************************************************************************/
#define PAL_MODE_RESET                  0U	// Состояние после сброса МК
#define PAL_MODE_UNCONNECTED            1U	// Вывод отключен
#define PAL_MODE_INPUT                  2U	// Высокоимпедансный вход
#define PAL_MODE_INPUT_PULLUP           3U	// Вход с слабой подтяжкой вверх
#define PAL_MODE_INPUT_PULLDOWN         4U	// Вход с слабой подтяжкой вниз
#define PAL_MODE_INPUT_ANALOG           5U	// Аналоговый вход
#define PAL_MODE_OUTPUT_PUSHPULL        6U	// Выход пуш-пул
#define PAL_MODE_OUTPUT_OPENDRAIN       7U	// Выход открытый сток
#define PAL_LOW                         0U	// Низкий уровень
#define PAL_HIGH 						1U	// Высокий уровень

/*******************************************************************************
Макросы работы с битами
*******************************************************************************/
#define PAL_PORT_BIT(n) ((ioportmask_t)(1U << (n)))

#define palReadLatch(port) pal_lld_readlatch(port)	////OK!

/*******************************************************************************
Макросы настройки выводов/портов
*******************************************************************************/
#define palSetGroupMode(port, mask, mode)    		                       \
	pal_lld_setgroupmode(port, mask, mode)

#define palSetPadMode(port, pad, mode)                                      \
	palSetGroupMode(port, PAL_PORT_BIT(pad), mode)

/*******************************************************************************
Макросы работы с портами
*******************************************************************************/
#define palReadPort(port) pal_lld_readport(port)
#define palWritePort(port, bits) pal_lld_writeport(port, bits)

/*******************************************************************************
Макросы работы с выводами
*******************************************************************************/
#define palReadPad(port, pad) ((palReadPort(port) >> (pad)) & 1U)
#define palWritePad(port, pad, bit)                                         \
  palWritePort(port, (palReadLatch(port) & ~PAL_PORT_BIT(pad)) |            \
  (((bit) & 1U) << pad))

/*******************************************************************************
Общии макросы
*******************************************************************************/
#define palInit() pal_lld_init()
